# Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [9]:
# A series is a 1D array which store data values along with idx or labels

# basic examplpe
arr = np.array([10,20,30,40,50])
df = pd.Series(arr)
print(df)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
# series using labels
arr = np.array([10,20,30,40,50])
labels = ['a','b','c','d','e']
df = pd.Series(arr, index=labels)
print(df)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
# Series using dictionary
dict = {'a':10, 'b':20, 'c':30, 'd':40, 'e':50}
df = pd.Series(dict)
print(df)

a    10
b    20
c    30
d    40
e    50
dtype: int64

# Creating Data Frame

In [2]:
# From Dictionary 

student_data ={
    "name" : ['sanjay', 'sachin', 'suresh', 'ramesh', 'mahesh'],
    "age" : [20, 21, 22, 23, 24],
    "marks" : [80, 85, 90, 95, 100]
}

df = pd.DataFrame(student_data)
print(df)

     name  age  marks
0  sanjay   20     80
1  sachin   21     85
2  suresh   22     90
3  ramesh   23     95
4  mahesh   24    100

In [8]:
# From Lists 

data = [
    ['sanjay' , 20 , 99],
    ['aastha' , 20 , 100],
    ['omkar' , 19 , 95]
]
df = pd.DataFrame(data , columns=['name','age','marks'])
print(df)

     name  age  marks
0  sanjay   20     99
1  aastha   20    100
2   omkar   19     95

In [9]:
# Basic Operations

df.head()

     name  age  marks
0  sanjay   20     99
1  aastha   20    100
2   omkar   19     95

In [10]:
df.tail()

     name  age  marks
0  sanjay   20     99
1  aastha   20    100
2   omkar   19     95

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [12]:
df.describe()

             age       marks
count   3.000000    3.000000
mean   19.666667   98.000000
std     0.577350    2.645751
min    19.000000   95.000000
25%    19.500000   97.000000
50%    20.000000   99.000000
75%    20.000000   99.500000
max    20.000000  100.000000

In [16]:
df.shape

(3, 3)

In [17]:
df.columns

Index(['name', 'age', 'marks'], dtype='object')

In [ ]:
# From Csv & Excel

df = pd.read_csv('kantesti_global_health_insights_2025_2026.csv')
print(df)

df = pd.read_excel('data.xlsx')
print(df)

# Selections Of Rows & Columns

In [ ]:
# Selecting columns

print(df['name']) # selecting single column
print(df[['name','age']]) # selecting multiple columns

0    sanjay
1    aastha
2     omkar
Name: name, dtype: object
     name  age
0  sanjay   20
1  aastha   20
2   omkar   19

In [ ]:
# Selecting rows
# loc and iloc are used to select rows based on index or labels

df.loc[0] # selecting single row
df.loc[0:2] # selecting multiple rows
df.loc[0:2 , 'name'] # selecting specific column from specific rows

df.iloc[0] # selecting single row
df.iloc[0:2] # selecting multiple rows
df.iloc[0:2 , 0] # selecting specific column from specific rows

0    sanjay
1    aastha
Name: name, dtype: object

In [ ]:
# Conditional selection

print(df[df['age'] >= 20]) # selecting rows based on condition
print(df[df['name'] == 'sanjay']) # selecting rows based on condition
print(df[df['marks'] >= 90]) # selecting rows based on condition

     name  age  marks
0  sanjay   20     99
1  aastha   20    100
     name  age  marks
0  sanjay   20     99
     name  age  marks
0  sanjay   20     99
1  aastha   20    100
2   omkar   19     95

# Updating Rows & Columns

In [ ]:
# Updating a single value 
df.loc[0 , 'name'] = 'sanjay lade'
print(df)

          name  age  marks
0  sanjay lade   20     99
1       aastha   20    100
2        omkar   19     95

In [ ]:
# Updating entire column
df['age'] = df['age'] + 1
print(df)

          name  age  marks
0  sanjay lade   21     99
1       aastha   21    100
2        omkar   20     95

In [ ]:
# updating multiple rows based on condition
df.loc[df['age'] >= 20, 'age'] = df['age'] + 1
print(df)

# updating multiple columns based on condition
df.loc[df['age'] >= 20, ['age','marks']] = df.loc[df['age'] >= 20, ['age','marks']] + 1
print(df)

          name  age  marks
0  sanjay lade   24    100
1       aastha   24    101
2        omkar   23     96
          name  age  marks
0  sanjay lade   25    101
1       aastha   25    102
2        omkar   24     97

In [ ]:
# updating using .apply() method
df['age'] = df['age'].apply(lambda x : 'adult' if x >= 18 else 'minor')
print(df)

# updating using .map() method
df['age'] = df['age'].map({'adult' : 1, 'minor' : 0})
print(df)

# updating using .replace() method
df['age'] = df['age'].replace({1 : 'adult', 0 : 'minor'})
print(df)

# updating using .where() method
df['age'] = df['age'].where(df['age'] == 'adult', 'minor')
print(df)

          name    age  marks
0  sanjay lade  adult    101
1       aastha  adult    102
2        omkar  adult     97
          name  age  marks
0  sanjay lade    1    101
1       aastha    1    102
2        omkar    1     97
          name    age  marks
0  sanjay lade  adult    101
1       aastha  adult    102
2        omkar  adult     97
          name    age  marks
0  sanjay lade  adult    101
1       aastha  adult    102
2        omkar  adult     97

In [ ]:
# updating column 
df.rename(columns={'age' : 'age_group'}, inplace=True) # renaming column name and inplace=True is used to update the original dataframe
print(df)

df.columns = ['name', 'age_group', 'marks'] # updating column names using columns attribute
print(df)

# Removing Rows & Columns

In [ ]:
# Removing columns

# using drop()
df.drop('age_group', axis=1, inplace=True) # dropping column and inplace=True is used to update the original dataframe
print(df)

df.drop(['name','marks'], axis=1, inplace=True) # dropping multiple columns using drop() method
print(df)

# using del keyword
del df['marks'] # dropping column using del keyword
print(df)

# using pop() method
df.pop('name') # dropping column using pop() method
print(df)

In [16]:
# Removing rows by index
df.drop(0, axis=0, inplace=True) # dropping row by index and inplace=True is used to update the original dataframe
print(df)

df.drop([1,2], axis=0, inplace=True) # dropping multiple rows using drop() method
print(df)

     name  age  marks
1  aastha   20    100
2   omkar   19     95
Empty DataFrame
Columns: [name, age, marks]
Index: []